rails/99cats/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "haram"], ["LIMIT", 1]]
---
  def self.find_by_credential(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "BI0nkF9DoHWizSjZmi5VGw"], ["updated_at", "2018-10-24 19:51:39.559120"], ["id", 2]]
---
  def reset_session_token
    self.session_token = self.class.generate_token
    self.save